
// Маршрутизація
// Додай маршрутизацію з бібліотекою React Router. У програмі має бути кілька сторінок:

// /register - публічний маршрут реєстрації нового користувача з формою
// /login - публічний маршрут логіна існуючого користувача з формою
// /contacts - приватний маршрут для роботи зі списком контактів користувача
// Додай компонент навігації Navigation з посиланнями для переходу по маршрутах.
export const UserMenu = () => {
  return (
    <div>
      <p>mango@mail.com</p>
      <button>Logout</button>
    </div>
  );
};
